tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "leoafarias/fvm"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Manage multiple Node.js versions
brew "nvm"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# General-purpose data compression with high compression ratio
brew "xz"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# Tools for building Android applications
cask "android-studio"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Reclaim tens of gigabytes of your storage used for various Xcode caches
cask "devcleaner"
# App to build and share containerized applications and microservices
cask "docker"
# Reimagine your terminal
cask "fig"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GUI replacement for the Java command-line utilities keytool and jarsigner
cask "keystore-explorer"
# Web browser
cask "microsoft-edge"
# Minimal installer for conda
cask "miniconda"
# App wrapper for Postgres
cask "postgres-unofficial"
# Collaboration platform for API development
cask "postman"
# GUI for streamlined Redis application development
cask "redisinsight"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# Utility to hide the notch
cask "topnotch"
# Open-source code editor
cask "visual-studio-code"
mas "GarageBand", id: 682658836
mas "HiddenMe", id: 467040476
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Messenger", id: 1480068668
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "TestFlight", id: 899247664
mas "Transporter", id: 1450874784
mas "Xcode", id: 497799835

